Revit 2026 API

# ControlledApplicationElementTypeDuplicated Event

---

Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<ElementTypeDuplicatedEventArgs> ElementTypeDuplicated
```
```vb
Public Event ElementTypeDuplicated As EventHandler(Of ElementTypeDuplicatedEventArgs)
```
```cpp
public:
 event EventHandler<ElementTypeDuplicatedEventArgs^>^ ElementTypeDuplicated {
	void add (EventHandler<ElementTypeDuplicatedEventArgs^>^ value);
	void remove (EventHandler<ElementTypeDuplicatedEventArgs^>^ value);
}
```
```fsharp
member ElementTypeDuplicated : IEvent<EventHandler<ElementTypeDuplicatedEventArgs>,
    ElementTypeDuplicatedEventArgs>
```

#### Value

EventHandlerElementTypeDuplicatedEventArgs

This event is raised immediately after Revit has finished duplicating an element type. It is raised even when duplicating an element type failed or was cancelled (during ElementTypeDuplicating event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' field in event's argument to see whether the action itself was successful or not.

This event is not cancellable, for the process of importing has already been finished.

If the action was not successful, the document may not be modified and new transactions may not be started.

The following API functions are not available for the current document during this event:

  * Close and similar overloads.

Exception InvalidOperationException will be thrown if any of the above methods is called during this event.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace